#+TITLE: Setting up ipad screen mirroring on nixos
#+CREATED: <2022-12-27 Tue>
#+LAST_MODIFIED: [2022-12-28 Wed 00:50]
#+ROAM_TAGS: composition
#+OPTIONS: toc:nil
#+OPTIONS: tex:t
#+OPTIONS: _:nil ^:nil p:nil

#+HUGO_BASE_DIR: ./
#+hugo_front_matter_format: yaml
#+HUGO_CUSTOM_FRONT_MATTER: :date (org-to-blog-date (org-global-prop-value "CREATED"))
#+HUGO_CUSTOM_FRONT_MATTER: :hero ./images/cover.png
#+HUGO_CUSTOM_FRONT_MATTER: :secret false
#+HUGO_CUSTOM_FRONT_MATTER: :excerpt Screens on screens

#+BEGIN_SRC emacs-lisp :exports none
  (defun org-hugo-link (link contents info) (org-md-link link contents info))

  ;; Setup org/latex exporting
  (add-to-list 'org-export-filter-latex-fragment-functions
               'sub-paren-for-dollar-sign)
  (add-to-list 'org-export-filter-headline-functions
               'remove-regexp-curly-braces)
  (add-to-list 'org-export-filter-latex-environment-functions
               'sub-paren-for-dollar-sign)
  (export-to-mdx-on-save)
#+END_SRC

#+RESULTS:
: Enabled mdx on save

Recently I bought an iPad so I can live share my notes to my laptop during
screencasts. This is incredibly useful for online meetings, presentations, or
pair programming sessions where I want to show notes to whoever in real-time.

In this blog post, I'll explain how I setup screen mirroring from my iPad to a
NixOS based setup. Whether you are using NixOS as your daily driver or just want
to try out screen mirroring on a *nix based system, hopefully my experience and
learnings can be helpful for you.

